#ifndef IMPL_VPOSIX_WRAP_SIGNAL_H
#define IMPL_VPOSIX_WRAP_SIGNAL_H

#include <sys/types.h>

//=======================================================================================
/*
 *  Автоматически устанавливает обработчики прерываний SIGINT, SIGKILL, SIGTERM
 *  на остановку поллинга.
 *
 *  http://man7.org/linux/man-pages/man2/kill.2.html
*/
//=======================================================================================


//=======================================================================================
namespace impl_vposix
{
    //===================================================================================
    class wrap_signal
    {
    public:
        static void kill        ( pid_t pid, int sig );
        static bool kill_no_err ( pid_t pid, int sig );

        static bool has_process ( pid_t pid );
    };
    //===================================================================================
}
//=======================================================================================


#endif // IMPL_VPOSIX_WRAP_SIGNAL_H
